int main()
{
	//Арифметически

	// + - * /    ^  (**)   %     //


	// СИ++  + - * / % 

	int a = 7;
	int b = 3;

	int c = a / b; // 2

	c = a % b; // c =   a - (a/b)*b  = 1 

	c = b - a;

	unsigned int uc = b - a;  // 2^32 - 4

	a = 10;

	b = 3;


	float fl = a / b; // 3.0000000  (если переменные int, то целое)


	float fa = a;

	fl = fa / b; // 3.3333333325

	char ch = 'a'; // ascii code


	ch = ch + ch; // -128 127

	ch = 97 + 97;



	int aa = 5;

	aa = aa + aa;


	//Логические 

	// < > == <= >=  !  !=  
	// && И 
	// 1 1 -> 1
	// 1 0 -> 0
	// 0 1 -> 0
	// 0 0 -> 0
	// 
	// || ИЛИ
	// 0 0 -> 0
	// 1 0 -> 1
	// 0 1 -> 1
	// 1 1 -> 1

	(4 < 5) && (7 < 8) == 1;

	bool bl1 = (4 < 5) && (7 < 8);


	(3 && 4) == 1;

	bool bl2 = (3 && 0);

	// -23 2323 -> 1
	//0 -> 0


	bool dsadsad =  ('a' <= '0'); // 'a' == 97

	bool bl4 = ('a' == 97);

	bool bl5 = ('0' == 48);

	bool bl6 = (3 && !8);

	bl5 = bl6 || bl4;



}